<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 4: Extra-Credit
</span>
</center></i>

# Introduction and Overview

## Overview

- This extra-credit homework is worth 2.5 points.


- There is one assignment for both the programming and non-programming track.


- By this point in the semester, you should not need all of the helper code that I have previously provided. You can find the code in previous notebooks, homework assignments, examples, etc.


- This homework uses the ```classicmodels``` database, which you have previously loaded.

## Submission Instructions

## Guidelines

__Note:__ TAs to make make any changes.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [1]:
# Print your name, uni, and track below

name = "Ziggy Chen"
uni = "xc2605"
track = "Non-programmming Track"

print(name)
print(uni)
print(track)

Ziggy Chen
xc2605
Non-programmming Track

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [4]:
%sql SHOW TABLES FROM classicmodels;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('customer_order_copy',),
 ('customer_order_summary',),
 ('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [5]:
%sql USE classicmodels;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql 
SELECT customerNumber, orderNumber, orderDate, productCode, quantityOrdered, priceEach 
FROM orders JOIN orderdetails USING(ordernumber) LIMIT 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(363, 10100, datetime.date(2003, 1, 6), 'S18_1749', 30, Decimal('136.00')),
 (363, 10100, datetime.date(2003, 1, 6), 'S18_2248', 50, Decimal('55.09')),
 (363, 10100, datetime.date(2003, 1, 6), 'S18_4409', 22, Decimal('75.46')),
 (363, 10100, datetime.date(2003, 1, 6), 'S24_3969', 49, Decimal('35.29')),
 (128, 10101, datetime.date(2003, 1, 9), 'S18_2325', 25, Decimal('108.06')),
 (128, 10101, datetime.date(2003, 1, 9), 'S18_2795', 26, Decimal('167.06')),
 (128, 10101, datetime.date(2003, 1, 9), 'S24_1937', 45, Decimal('32.53')),
 (128, 10101, datetime.date(2003, 1, 9), 'S24_2022', 46, Decimal('44.35')),
 (181, 10102, datetime.date(2003, 1, 10), 'S18_1342', 39, Decimal('95.55')),
 (181, 10102, datetime.date(2003, 1, 10), 'S18_1367', 41, Decimal('43.13'))]

# Star Schema

- Create a [Star Schema](https://en.wikipedia.org/wiki/Star_schema) for the ```classicmodels``` database.


- My schema name is ```classicmodels_olap``` and the schema is:

```
create table if not exists classicmodels_olap.date_dimension
(
    orderDate               date not null
        primary key,
    `year(orderDate)`       int  null,
    `quarter(orderDate)`    int  null,
    `month(orderDate)`      int  null,
    `dayofmonth(orderDate)` int  null
);

create table if not exists classicmodels_olap.location_dimension
(
    location_dimension_id int auto_increment
        primary key,
    city                  varchar(50) charset latin1 not null,
    country               varchar(50) charset latin1 not null,
    region                varchar(12)                null
);

create table if not exists classicmodels_olap.product_dimension
(
    productLine          varchar(50) charset latin1 not null,
    productScale         varchar(10) charset latin1 not null,
    productVendor        varchar(50) charset latin1 not null,
    product_dimension_id int auto_increment
        primary key
);

create table if not exists classicmodels_olap.order_facts
(
    location_dimension_id int                        null,
    product_dimension_id  int                        null,
    orderDate             date                       not null,
    customerNumber        int                        not null,
    productCode           varchar(15) charset latin1 not null,
    orderNumber           int                        not null,
    quantityOrdered       int                        not null,
    priceEach             decimal(10, 2)             not null,
    constraint order_facts_date_dimension_null_fk
        foreign key (orderDate) references classicmodels_olap.date_dimension (orderDate),
    constraint order_facts_location_dimension_null_fk
        foreign key (location_dimension_id) references classicmodels_olap.location_dimension (location_dimension_id),
    constraint order_facts_product_dimension_null_fk
        foreign key (product_dimension_id) references classicmodels_olap.product_dimension (product_dimension_id)
);
```

### Now, let us create the star schema.

In [7]:
%%sql

DROP SCHEMA IF EXISTS classicmodels_olap;
CREATE SCHEMA classicmodels_olap;
USE classicmodels_olap;

create table if not exists classicmodels_olap.date_dimension
(
    orderDate               date not null
        primary key,
    `year(orderDate)`       int  null,
    `quarter(orderDate)`    int  null,
    `month(orderDate)`      int  null,
    `dayofmonth(orderDate)` int  null
);

create table if not exists classicmodels_olap.location_dimension
(
    location_dimension_id int auto_increment
        primary key,
    city                  varchar(50) charset latin1 not null,
    country               varchar(50) charset latin1 not null,
    region                varchar(12)                null
);

create table if not exists classicmodels_olap.product_dimension
(
    productLine          varchar(50) charset latin1 not null,
    productScale         varchar(10) charset latin1 not null,
    productVendor        varchar(50) charset latin1 not null,
    product_dimension_id int auto_increment
        primary key
);

create table if not exists classicmodels_olap.order_facts
(
    location_dimension_id int                        null,
    product_dimension_id  int                        null,
    orderDate             date                       not null,
    customerNumber        int                        not null,
    productCode           varchar(15) charset latin1 not null,
    orderNumber           int                        not null,
    quantityOrdered       int                        not null,
    priceEach             decimal(10, 2)             not null,
    constraint order_facts_date_dimension_null_fk
        foreign key (orderDate) references classicmodels_olap.date_dimension (orderDate),
    constraint order_facts_location_dimension_null_fk
        foreign key (location_dimension_id) references classicmodels_olap.location_dimension (location_dimension_id),
    constraint order_facts_product_dimension_null_fk
        foreign key (product_dimension_id) references classicmodels_olap.product_dimension (product_dimension_id)
);

 * mysql+pymysql://root:***@localhost
4 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [8]:
%sql DESCRIBE date_dimension;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('orderDate', 'date', 'NO', 'PRI', None, ''),
 ('year(orderDate)', 'int', 'YES', '', None, ''),
 ('quarter(orderDate)', 'int', 'YES', '', None, ''),
 ('month(orderDate)', 'int', 'YES', '', None, ''),
 ('dayofmonth(orderDate)', 'int', 'YES', '', None, '')]

In [9]:
%sql DESCRIBE location_dimension;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('location_dimension_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('city', 'varchar(50)', 'NO', '', None, ''),
 ('country', 'varchar(50)', 'NO', '', None, ''),
 ('region', 'varchar(12)', 'YES', '', None, '')]

In [10]:
%sql DESCRIBE product_dimension;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('productLine', 'varchar(50)', 'NO', '', None, ''),
 ('productScale', 'varchar(10)', 'NO', '', None, ''),
 ('productVendor', 'varchar(50)', 'NO', '', None, ''),
 ('product_dimension_id', 'int', 'NO', 'PRI', None, 'auto_increment')]

In [11]:
%sql DESCRIBE order_facts;

 * mysql+pymysql://root:***@localhost
8 rows affected.

[('location_dimension_id', 'int', 'YES', 'MUL', None, ''),
 ('product_dimension_id', 'int', 'YES', 'MUL', None, ''),
 ('orderDate', 'date', 'NO', 'MUL', None, ''),
 ('customerNumber', 'int', 'NO', '', None, ''),
 ('productCode', 'varchar(15)', 'NO', '', None, ''),
 ('orderNumber', 'int', 'NO', '', None, ''),
 ('quantityOrdered', 'int', 'NO', '', None, ''),
 ('priceEach', 'decimal(10,2)', 'NO', '', None, '')]

- In the following cells, write and execute SQL to load data from ```classicmodels``` into ```classicmodels_olap.```

In [12]:
%%sql

INSERT INTO classicmodels_olap.date_dimension (orderDate, `year(orderDate)`, `quarter(orderDate)`, `month(orderDate)`, `dayofmonth(orderDate)`)
SELECT DISTINCT orderDate,
       YEAR(orderDate) AS `year(orderDate)`,
       QUARTER(orderDate) AS `quarter(orderDate)`,
       MONTH(orderDate) AS `month(orderDate)`,
       DAY(orderDate) AS `dayofmonth(orderDate)`
FROM classicmodels.orders;

 * mysql+pymysql://root:***@localhost
265 rows affected.

[]

In [16]:
%sql SELECT * FROM date_dimension LIMIT 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[(datetime.date(2003, 1, 6), 2003, 1, 1, 6),
 (datetime.date(2003, 1, 9), 2003, 1, 1, 9),
 (datetime.date(2003, 1, 10), 2003, 1, 1, 10),
 (datetime.date(2003, 1, 29), 2003, 1, 1, 29),
 (datetime.date(2003, 1, 31), 2003, 1, 1, 31),
 (datetime.date(2003, 2, 11), 2003, 1, 2, 11),
 (datetime.date(2003, 2, 17), 2003, 1, 2, 17),
 (datetime.date(2003, 2, 24), 2003, 1, 2, 24),
 (datetime.date(2003, 3, 3), 2003, 1, 3, 3),
 (datetime.date(2003, 3, 10), 2003, 1, 3, 10),
 (datetime.date(2003, 3, 18), 2003, 1, 3, 18),
 (datetime.date(2003, 3, 24), 2003, 1, 3, 24),
 (datetime.date(2003, 3, 25), 2003, 1, 3, 25),
 (datetime.date(2003, 3, 26), 2003, 1, 3, 26),
 (datetime.date(2003, 4, 1), 2003, 2, 4, 1),
 (datetime.date(2003, 4, 4), 2003, 2, 4, 4),
 (datetime.date(2003, 4, 11), 2003, 2, 4, 11),
 (datetime.date(2003, 4, 16), 2003, 2, 4, 16),
 (datetime.date(2003, 4, 21), 2003, 2, 4, 21),
 (datetime.date(2003, 4, 28), 2003, 2, 4, 28)]

In [13]:
%%sql

INSERT INTO classicmodels_olap.location_dimension (city, country, region)
SELECT DISTINCT city, country, state
FROM classicmodels.offices;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[]

In [17]:
%sql SELECT * FROM location_dimension LIMIT 20;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, 'San Francisco', 'USA', 'CA'),
 (2, 'Boston', 'USA', 'MA'),
 (3, 'NYC', 'USA', 'NY'),
 (4, 'Paris', 'France', None),
 (5, 'Tokyo', 'Japan', 'Chiyoda-Ku'),
 (6, 'Sydney', 'Australia', None),
 (7, 'London', 'UK', None)]

In [14]:
%%sql

INSERT INTO classicmodels_olap.product_dimension (productLine, productScale, productVendor)
SELECT DISTINCT pl.productLine, p.productScale, p.productVendor
FROM classicmodels.products p
JOIN classicmodels.productlines pl ON p.productLine = pl.productLine;

 * mysql+pymysql://root:***@localhost
89 rows affected.

[]

In [18]:
%sql SELECT * FROM product_dimension LIMIT 20;

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('Classic Cars', '1:10', 'Classic Metal Creations', 1),
 ('Classic Cars', '1:10', 'Motor City Art Classics', 2),
 ('Classic Cars', '1:10', 'Second Gear Diecast', 3),
 ('Classic Cars', '1:12', 'Autoart Studio Design', 4),
 ('Classic Cars', '1:12', 'Second Gear Diecast', 5),
 ('Classic Cars', '1:18', 'Welly Diecast Productions', 6),
 ('Classic Cars', '1:12', 'Welly Diecast Productions', 7),
 ('Classic Cars', '1:12', 'Studio M Art Models', 8),
 ('Classic Cars', '1:18', 'Highway 66 Mini Classics', 9),
 ('Classic Cars', '1:18', 'Classic Metal Creations', 10),
 ('Classic Cars', '1:18', 'Gearbox Collectibles', 11),
 ('Classic Cars', '1:18', 'Min Lin Diecast', 12),
 ('Classic Cars', '1:18', 'Red Start Diecast', 13),
 ('Classic Cars', '1:18', 'Unimax Art Galleries', 14),
 ('Classic Cars', '1:18', 'Studio M Art Models', 15),
 ('Classic Cars', '1:24', 'Unimax Art Galleries', 16),
 ('Classic Cars', '1:24', 'Highway 66 Mini Classics', 17),
 ('Classic Cars', '1:24', 'Carousel DieCast Legends', 18),
 ('Classic Cars', '1:24', 'Classic Metal Creations', 19),
 ('Classic Cars', '1:24', 'Exoto Designs', 20)]

In [15]:
%%sql

INSERT INTO classicmodels_olap.order_facts (location_dimension_id, product_dimension_id, orderDate, customerNumber, productCode, orderNumber, quantityOrdered, priceEach)
SELECT
    ld.location_dimension_id,
    pd.product_dimension_id,
    o.orderDate,
    o.customerNumber,
    od.productCode,
    od.orderNumber,
    od.quantityOrdered,
    od.priceEach
FROM classicmodels.orders o
JOIN classicmodels.orderdetails od ON o.orderNumber = od.orderNumber
JOIN classicmodels.products p ON od.productCode = p.productCode
JOIN classicmodels.productlines pl ON p.productLine = pl.productLine
JOIN classicmodels.customers c ON o.customerNumber = c.customerNumber
JOIN classicmodels.offices ofc ON c.salesRepEmployeeNumber = ofc.officeCode
JOIN classicmodels_olap.location_dimension ld ON ofc.city = ld.city AND ofc.country = ld.country
JOIN classicmodels_olap.product_dimension pd ON pl.productLine = pd.productLine AND p.productScale = pd.productScale AND p.productVendor = pd.productVendor;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

- In the following cells, write SQL statements that test and demonstrate that you have correctly loaded the data.


- You must write at least 5 test statements.